geval-jar/src/test/resources/berichten/geval-alles-antwoord.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Body>
        <ns2:GevalAntwoord xmlns="http://xmlns.rotterdam.nl/geval/v1"
                           xmlns:ns2="http://xmlns.rotterdam.nl/geval/operations/v1"
                           xmlns:ns3="http://rotterdam.nl/schemas/identify/2.0/">
            <ns2:CheckResult>
                <Type>e-mail</Type>
                <Gegeven>gebruiker-at-rotterdam.nl</Gegeven>
                <Validatie>fout</Validatie>
                <Detail>INVALIDE_SYNTAX</Detail>
            </ns2:CheckResult>
            <ns2:CheckResult>
                <Type>e-mail</Type>
                <Gegeven>g..bruiker@rotterdam.nl</Gegeven>
                <Validatie>fout</Validatie>
                <Detail>INVALIDE_SYNTAX_GEBRUIKER</Detail>
            </ns2:CheckResult>
            <ns2:CheckResult>
                <Type>e-mail</Type>
                <Gegeven>gebruiker@rotterdam</Gegeven>
                <Validatie>fout</Validatie>
                <Detail>INVALIDE_SYNTAX_DOMEIN</Detail>
            </ns2:CheckResult>
            <ns2:CheckResult>
                <Type>e-mail</Type>
                <Gegeven>gebruiker@rot456terdam.uk</Gegeven>
                <Validatie>fout</Validatie>
                <Detail>DOMEIN_BESTAAT_NIET</Detail>
            </ns2:CheckResult>
            <ns2:CheckResult>
                <Type>e-mail</Type>
                <Gegeven>gebruiker@rotterdam.uk</Gegeven>
                <Validatie>fout</Validatie>
                <Detail>DOMEIN_ZONDER_EMAIL</Detail>
            </ns2:CheckResult>
            <ns2:CheckResult>
                <Type>e-mail</Type>
                <Gegeven>gebruiker@gmail.com</Gegeven>
                <Validatie>goed</Validatie>
                <Detail>DOMEIN_MET_EMAIL</Detail>
            </ns2:CheckResult>
            <ns2:CheckResult>
                <Type>e-mail</Type>
                <Gegeven>g.e.bruiker@rotterdam.nl</Gegeven>
                <Validatie>fout</Validatie>
                <Detail>ONBEKEND_ACCOUNT</Detail>
            </ns2:CheckResult>
            <ns2:CheckResult>
                <Type>e-mail</Type>
                <Gegeven>w.hu1@rotterdam.nl</Gegeven>
                <Validatie>goed</Validatie>
                <Detail>GELDIG_ADRES</Detail>
            </ns2:CheckResult>
        </ns2:GevalAntwoord>
    </soap:Body>
</soap:Envelope>